morse_code = {
    'А': '.-',
    'Б': '-...',
    'В': '.--', 
    'Г': '--.', 
    'Д': '-..', 
    'Е': '.', 
    'Ё': '.', 
    'Ж': '...-', 
    'З': '--..', 
    'И': '..', 
    'Й': '.---', 
    'К': '-.-', 
    'Л': '.-..', 
    'М': '--', 
    'Н': '-.', 
    'О': '---', 
    'П': '.--.', 
    'Р': '.-.', 
    'С': '...', 
    'Т': '-', 
    'У': '..-', 
    'Ф': '..-.', 
    'Х': '....', 
    'Ц': '-.-.', 
    'Ч': '---.', 
    'Ш': '----', 
    'Щ': '--.-', 
    'Ъ': '--.--', 
    'Ы': '-.--', 
    'Ь': '-..-', 
    'Э': '..-..', 
    'Ю': '..--', 
    'Я': '.-.-', 
    '0': '-----', 
    '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.', 
    '.': '.-.-.-', ',': '--..--', ';': '-.-.-.', ':': '---...', '?': '..--..', '!': '-.-.--', '-': '-....-', ' ': '\t'
}
from codeer import coder
coder ()

from codeer import decoder
decoder ()

def main():
    while True:
        print("Выберите действие:")
        print("1. Кодирование текста в азбуку Морзе")
        print("2. Декодирование азбуки Морзе в текст")
        print("3. Выход")

        choice = input("Введите номер действия: ")

        if choice == "1":
            text = input("Введите текст для кодирования: ")
            encoded = coder(text)
            print(f"Закодированный текст: {encoded}")
        elif choice == "2":
            morsecode = input("Введите код азбуки Морзе для декодирования: ")
            decoded = decoder(morsecode)
            print(f"Раскодированный текст: {decoded}")
        elif choice == "3":
            print("Программа завершена.")
            break
        else:
            print("Некорректный ввод. Попробуйте снова.")

main()